# 1. What are some key methods in Pandas for basic data exploration?

- df.head()
- df.tail()
- df.info()
- df.describe()
- df.isnull()
- df.isnull().sum()
- df.columns()

# 2. Create a sample DataFrame of employees with at least 6 rows and 4 columns.

Create a DataFrame using the following structure and store it in a variable called df_employees:

data = {
    
    'Name': ['Amit', 'Bhavna', 'Chirag', 'Deepa', 'Eshan', 'Farah'],
    
    'Department': ['HR', 'Finance', 'IT', 'HR', 'Finance', 'IT'],
    
    'Experience': [3, 7, 5, 2, 10, 4],
    
    'Salary': [45000, 70000, 60000, 40000, 85000, 55000]
}

In [113]:
import pandas as pd
data = {
'Name': ['Amit', 'Bhavna', 'Chirag', 'Deepa', 'Eshan', 'Farah'],
'Department': ['HR', 'Finance', 'IT', 'HR', 'Finance', 'IT'],
'Experience': [3, 7, 5, 2, 10, 4],
'Salary': [45000, 70000, 60000, 40000, 85000, 55000]
}

df_employees=pd.DataFrame(data)
df_employees

     Name Department  Experience  Salary
0    Amit         HR           3   45000
1  Bhavna    Finance           7   70000
2  Chirag         IT           5   60000
3   Deepa         HR           2   40000
4   Eshan    Finance          10   85000
5   Farah         IT           4   55000

# 3. Display the first and last 3 rows of the DataFrame.

Use appropriate methods to display:

The first 3 rows.

The last 3 rows.

In [116]:
df_employees.head(3)

     Name Department  Experience  Salary
0    Amit         HR           3   45000
1  Bhavna    Finance           7   70000
2  Chirag         IT           5   60000

In [118]:
df_employees.tail(3)

    Name Department  Experience  Salary
3  Deepa         HR           2   40000
4  Eshan    Finance          10   85000
5  Farah         IT           4   55000

# 4. Show and Explain Statistical Summary for Numerical Columns.

Use Pandas methods to generate descriptive statistics for the numerical columns from your own DataFrame:

And Explain in a Comment or Markdown about the below methods with your own example not google example or AI generated.

    Count

    Mean

    Median

    Standard deviation

    Min and Max

    25%, 50%, 75% percentiles

In [121]:
df_employees.describe()

       Experience        Salary
count    6.000000      6.000000
mean     5.166667  59166.666667
std      2.926887  16557.978943
min      2.000000  40000.000000
25%      3.250000  47500.000000
50%      4.500000  57500.000000
75%      6.500000  67500.000000
max     10.000000  85000.000000

- Count-Returns total no of non null values in the column.
- Mean-Avg value of all the numbers in that column.
- Median-The middle value after sorting of numbers.
- Standard deviation-Measures how much the data varies from the mean.
- Min and Max-The smallest and largest value in the column. 
- 25%-25% of data points are below this value.
- 50%-50% of data points are below this value.
- 75%-75% of data points are below this value.

# 5. Check for missing values in the DataFrame.

If there are no missing values, then display the empty dataframe after performing.

In [125]:
df_employees.isnull()

    Name  Department  Experience  Salary
0  False       False       False   False
1  False       False       False   False
2  False       False       False   False
3  False       False       False   False
4  False       False       False   False
5  False       False       False   False

In [127]:
df_employees.isnull().sum()

Name          0
Department    0
Experience    0
Salary        0
dtype: int64

In [129]:
df_employees[df_employees.isnull().any(axis=1)]

Empty DataFrame
Columns: [Name, Department, Experience, Salary]
Index: []

# 6. Filter and display employees who have more than 5 years of experience.

Use conditional filtering to extract relevant rows.

In [132]:
df_employees[df_employees['Experience']>5]

     Name Department  Experience  Salary
1  Bhavna    Finance           7   70000
4   Eshan    Finance          10   85000

# 7. Group the DataFrame by Department and calculate the mean salary for each Department.

In [135]:
grouped=df_employees.groupby('Department')
mean_salary=grouped['Salary'].mean()
print(mean_salary)

Department
Finance    77500.0
HR         42500.0
IT         57500.0
Name: Salary, dtype: float64

# 8. Sort the DataFrame by Salary in descending order.

    Sort the DataFrame based on Salary from highest to lowest.

In [138]:
sorted_df=df_employees.sort_values(by='Salary',ascending=False)
print(sorted_df)

     Name Department  Experience  Salary
4   Eshan    Finance          10   85000
1  Bhavna    Finance           7   70000
2  Chirag         IT           5   60000
5   Farah         IT           4   55000
0    Amit         HR           3   45000
3   Deepa         HR           2   40000

# 9. Create a new column “Tax” where Tax = 10% of Salary.

    Add a derived column using vectorized operations.

In [141]:
df_employees['Tax']=df_employees["Salary"]*0.10
df_employees

     Name Department  Experience  Salary     Tax
0    Amit         HR           3   45000  4500.0
1  Bhavna    Finance           7   70000  7000.0
2  Chirag         IT           5   60000  6000.0
3   Deepa         HR           2   40000  4000.0
4   Eshan    Finance          10   85000  8500.0
5   Farah         IT           4   55000  5500.0

# 10. In a markdown cell, answer the following:

What is the difference between .loc[] and .iloc[]?

When would you use each?

- .loc[]

         - Label based indexing

  
         - Uses row/column labels


         - Inclusive of both start and end labels


         - Raises KeyError if label not found
  
- .iloc[]

          - Integer/position-based indexing


          - Uses row/column positions


          - Exclusive of the end position


          - Raises IndexError if index out of range

.loc[]-when you know row/column labels.

.iloc[]-when you know row/column positions.